NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120_enga/nrf7120_enga_flpr_peripherals.h
/*

Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF7120_ENGA_FLPR_PERIPHERALS_H
#define NRF7120_ENGA_FLPR_PERIPHERALS_H

#ifdef __cplusplus
    extern "C" {
#endif

#include <stdbool.h>
/*VPR CSR registers*/
#define VPRCSR_PRESENT 1
#define VPRCSR_COUNT 1

#define VPRCSR_HARTNUM 14                            /*!< HARTNUM: 14                                                          */
#define VPRCSR_MCLICBASERESET 0xF0000000             /*!< MCLICBASE: 0xF0000000                                                */
#define VPRCSR_MULDIV 2                              /*!< (unspecified)                                                        */
#define VPRCSR_HIBERNATE 1                           /*!< HIBERNATE: 1                                                         */
#define VPRCSR_DBG 1                                 /*!< DBG: 1                                                               */
#define VPRCSR_REMAP 1                               /*!< (unspecified)                                                        */
#define VPRCSR_BUSWIDTH 64                           /*!< (unspecified)                                                        */
#define VPRCSR_BKPT 4                                /*!< Number of HW breakpoints: 4                                          */
#define VPRCSR_RETAINED 0                            /*!< VPR cannot be retained                                               */
#define VPRCSR_VIOPINS 0x0000FFFF                    /*!< CSR VIOPINS value: 0x0000FFFF                                        */
#define VPRCSR_VEVIF_NTASKS_MIN 16                   /*!< VEVIF tasks: 16..22                                                  */
#define VPRCSR_VEVIF_NTASKS_MAX 22                   /*!< VEVIF tasks: 16..22                                                  */
#define VPRCSR_VEVIF_NTASKS_SIZE 23                  /*!< VEVIF tasks: 16..22                                                  */
#define VPRCSR_VEVIF_TASKS_MASK 0x007F0000           /*!< Mask of supported VEVIF tasks: 0x007F0000                            */
#define VPRCSR_VEVIF_NDPPI_MIN 0                     /*!< VEVIF DPPI indices: 0..3                                             */
#define VPRCSR_VEVIF_NDPPI_MAX 3                     /*!< VEVIF DPPI indices: 0..3                                             */
#define VPRCSR_VEVIF_NDPPI_SIZE 4                    /*!< VEVIF DPPI indices: 0..3                                             */
#define VPRCSR_VEVIF_NEVENTS_MIN 0                   /*!< VEVIF events: 0..31                                                  */
#define VPRCSR_VEVIF_NEVENTS_MAX 31                  /*!< VEVIF events: 0..31                                                  */
#define VPRCSR_VEVIF_NEVENTS_SIZE 32                 /*!< VEVIF events: 0..31                                                  */
#define VPRCSR_BEXT 1                                /*!< (unspecified)                                                        */
#define VPRCSR_CACHE_EN 1                            /*!< CACHE available                                                      */
#define VPRCSR_OUTMODE_VPR1_2 1                      /*!< OUTMODE for shifting functionality available                         */
#define VPRCSR_VPR_BUS_PRIO 1                        /*!< (unspecified)                                                        */
#define VPRCSR_PERIPHERALBLOCKINGACCESS 0            /*!< VPR does not support peripheral blocking access                      */
#define VPRCSR_RTP_VPR_1_5 1                         /*!< New RTP features                                                     */
#define VPRCSR_VPR_CLIC_3_LVL_BITS 0                 /*!< CLIC supports 2 level bits                                           */

/*VPR CLIC registers*/
#define CLIC_PRESENT 1
#define CLIC_COUNT 1

#define VPRCLIC_IRQ_COUNT 7
#define VPRCLIC_IRQNUM_MIN 0                         /*!< Supported interrupts (IRQNUM): 0..270                                */
#define VPRCLIC_IRQNUM_MAX 270                       /*!< Supported interrupts (IRQNUM): 0..270                                */
#define VPRCLIC_IRQNUM_SIZE 271                      /*!< Supported interrupts (IRQNUM): 0..270                                */
#define VPRCLIC_CLIC_NTASKS_MIN 16                   /*!< VEVIF tasks: 16..22                                                  */
#define VPRCLIC_CLIC_NTASKS_MAX 22                   /*!< VEVIF tasks: 16..22                                                  */
#define VPRCLIC_CLIC_NTASKS_SIZE 23                  /*!< VEVIF tasks: 16..22                                                  */
#define VPRCLIC_CLIC_TASKS_MASK 0x007F0000           /*!< Mask of supported VEVIF tasks: 0x007F0000                            */
#define VPRCLIC_COUNTER_IRQ_NUM 31                   /*!< VPR counter (CNT0) interrupt handler number (COUNTER_IRQ_NUM): 31    */
#define VPRCLIC_VPR_CLIC_3_LVL_BITS 0                /*!< CLIC supports 2 level bits                                           */

